Tekla.Structures.Dialog.UIControls.MaterialCatalog
The MaterialCatalog class represents a group of controls to select materials
using the material catalog.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.#ctor(System.String)
Creates a new instance of the MaterialCatalog and will select
the material (if available) in the tree.
Material: The material to be selected in the dialog.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.SelectedMaterial
Gets the selected material in the control.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.OnLoad(System.EventArgs)
When the load event is raised, the control begins to enumerate through the material
catalog.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.MaterialCatalog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.